<template>
    <section class="questions" id="questions" aria-label="questions-title">
        <div class="questions__main container">
            <h2 class="questions__title h1">{{ questionsTitle }}</h2>
            <ul class="questions__list">
                <li class="questions__item">
                    <Accordion :items='accordionItems'></Accordion>
                </li>
            </ul>
        </div>
    </section>

</template>

<script setup>
import Accordion from './Accordion.vue';

const questionsTitle = 'Часто задаваемые вопросы'

const accordionItems = [
    {
        title: 'Зачем мне юрист?',
        content: 'Юрист поможет вам защитить ваши права, правильно оформить документы, представить ваши интересы в суде и избежать правовых ошибок, которые могут дорого обойтись.'
    },
    {
        title: 'Сколько стоит консультация?',
        content: 'Стоимость зависит от сложности вопроса...'
    },
    {
        title: 'Как найти нужного юриста?',
        content: 'Создайте заявку, подробно описав вашу правовую проблему, специализацию и город. После этого у вас есть два варианта: либо выберите подходящего юриста из открывшегося каталога специалистов и свяжитесь с ним напрямую, либо дождитесь откликов юристов на вашу заявку.'
    },
    {
        title: 'Как вы отбираете юристов?',
        content: 'Мы проверяем высшее юридическое образование, релевантный опыт работы в конкретных отраслях права и наличие успешных проектов как показатель профессионализма.'
    },
    {
        title: 'Где посмотреть отзывы на юристов?',
        content: 'Отзывы клиентов доступны в профиле каждого юриста на нашей платформе. Вы можете ознакомиться с опытом других пользователей и рейтингами специалистов.'
    },
    {
        title: 'Как связаться с юристом?',
        content: 'После выбора специалиста вы можете связаться с ним через контактные данные в профиле: телефон, email или онлайн-форму на платформе.'
    },
    {
        title: 'Нужно ли заключать договор с юристом?',
        content: 'Да, рекомендуется заключать письменный договор на оказание юридических услуг, где будут указаны объем работ, сроки и стоимость услуг.'
    },
    {
        title: 'Мне не понравилась работа юриста. Как поступить в такой ситуации?',
        content: 'Правотека не несет ответственность за качество оказанной юридической помощи. Рекомендуем обязательно заключать письменный договор с юристом - это позволит вам предъявлять обоснованные требования по качеству услуг. Несмотря на то, что ответственность несет юрист, Правотека приложит возможные усилия для помощи в урегулировании разногласий между вами и специалистом.'
    },
]



</script>

<style scoped lang="scss">
.questions {
    &__main {
        padding-top: fluid(100, 50) ;
        padding-bottom: fluid(100, 50);
        
    }

    &__title {
        text-align: start;
    }

    &__list {
        display: flex;
        flex-direction: column;
        row-gap: rem(20);
        margin-top: fluid(50, 30);
        
    }
}
</style>